/**
 * Зроблено:
 * ПІБ: Світличний Дмитро Євгенович
 * Група студента: 123
 * Lab 1.7
 */
// Завдання 3

#include <iostream>
int main()
{
    float A = 10; // Опис та ініціалізація динамічної змінної поза циклом
    for (int i = 0; i < 5; i++)
    {
        int B = 10; // Опис та ініціалізація динамічної змінної в циклі
        A += 10;    // Додавання змінної А на 10
        B += 10;    // Додавання змінної B на 10
    } // В результаті всіх ітерацій змінна А = 60, а змінна В не існує поза циклом і досягає значення не більше 20 бо кожну ітерацію знову ініціалізується зі значенням 10

    char C = '!'; // Опис та ініціалізація змінної С, в цьому блоці її значення = '!'
    {
        char C = '@'; // Опис та ініціалізація другої змінної С, а також зміна значення першої змінної С в цьому блоці
        int D = 10;
        {
            char C = '$';
            int D = 20;
            int E = 15;
        }
        D = D + 5;
    }
    for (int i = 0; i < 5; i = i + 1)

    {

        static int iA = 0;
        int iB = 0;
        iA = iA + 1;
        iB = iB + 1; 
    } //В результаті кожної ітерації динамічна змінна знову ініціалізується зі значенням 0 і обнуляється, тоді як статична змінна продовжує накопичувати значення
}
