/**
 * Зроблено:
 * ПІБ: Світличний Дмитро Євгенович
 * Група студента: 123
 * Lab 1.7
 */
// Завдання 2

static int A = 10; // Опис та ініціація глобальної статичної змінної поза функції main
static int B;
#include <iostream>
int main()
{
    B = 20; // Задання значення глобальній статичній змінній
    {
        static int C = 15; // Опис та ініціація статичної локальної змінної
        int D;             // Опис звичайної локальної змінної
        C = B * 5;
        D = C + A;
    }
    // Змінні С та D недоступні поза блоком
    A += 10; // Збільшення статичної глобальної змінної на 10
    B++;     // Збільшення статичної глобальної змінної на 1
    for (int i = 0; i < 5; i++)
    {
        static int E = 0;
        E++;
    } // Цикл, в результаті кожної ітерації якого, статична змінна Е збільшується на 1, якщо Е була б не статичною змінною то в результаті всіх ітерацій Е дорівнювала б 1
}